import Footer from '@/components/footer';
import NavigationBar from '@/components/navigationBar';
import React from 'react';
import { Container, Row, Col } from 'react-bootstrap';

const Instruction = () => {
  return (
    <>
    <NavigationBar/>
      <div className="flex justify-center items-center" style={{ marginTop: '50px' }}>
        <h1 className="text-3xl font-bold">വിത്തുകള് നടുന്ന വിധം</h1>
      </div>

      <Container>
        <Row style={{display: 'flex',marginTop:'20px',height:'510px'}}>
          <Col  className='bg-light-green'xs={3} style={{ padding: '10px',marginLeft:'45px'}}>
            <div style={{ height: '100%', alignItems: 'center' }}>
            </div>
          </Col>
          <Col style={{paddingLeft:'20px',paddingTop:'40px',paddingRight:'25px'}}>
            {/* Example content */}
            <p>1.ബദാം, പേര, നീർമരുത്, വേങ്ങ, താന്നി, കുമിഴ് : ഇവ ചാക്കോടെ രണ്ട് ദിവസം പച്ചവെള്ളത്തിലിടുക, പിന്നെ ബെഡിലിടുക.</p>
            <p>2.നെല്ലി, ഉങ്ങ്,കരിങ്ങാര്, സീതാപ്പഴം, കൂവളം, മാദളം, ചമത, മന്താരം, പൂവരശ്, സുബാബൂല്‍: ഇവ രണ്ട് മണിക്കൂര്‍ പച്ചവെള്ളത്തിലിടുക അതിന് ശേഷം ബെഡിലിടുക. മുകളില്‍ പൊടിമണ്ണിടുക താഴ്ത്തി നനയ്ക്കുക.</p>
            <p>3.മഹാഗണി, വീട്ടി, ലക്ഷ്മി തരു : മൂന്ന് മണിക്കൂര്‍ പച്ചവെള്ളത്തിലിടുക. പിന്നെ ബെഡിലിടുക. വിത്ത് മറയുന്ന രീതിയില്‍ മണ്ണിടുക.</p>
            <p>4.മുള : ഒരു ദിവസം ചാണക വെള്ളത്തിലിടുക. രണ്ടാം ദിവസം ആ വെള്ളം ഒഴിവാക്കി മുകളില്‍ ഭാരം കയറ്റി വെയ്ക്കുക. മുള തുടങ്ങുമ്പോള്‍ ബെഡിലിടുക.</p>
            <p>5.ചന്ദനം, രക്തചന്ദനം : ഇവ രണ്ട് ദിവസം ചാണക വെള്ളത്തിലിടുക. അതിന് ശേഷം ആ വെള്ളം ഒഴിവാക്കി ചാക്കിലിട്ട് ചാക്ക് നനയ്ക്കുക. മുള തുടങ്ങുമ്പോള്‍ ബെഡിലിടുക. ചന്ദനത്തിന്‍റെ വിത്തിന്‍റെ കൂടെ ചെറുപയര്‍ വിത്ത് ഇടുക.</p>
            <p>6.ഗുള്‍മോർ, കണിക്കൊന്ന : 5 മിനിറ്റ് ചൂടുവെള്ളത്തിലിടുക. അതിന് ശേഷം 12 മണിക്കൂര്‍ പച്ച വെള്ളത്തിലിടുക പിന്നെ ബെഡിലിടുക.</p>
            <p>7.റെയിന്‍ട്രി : 4 മണിക്കൂര്‍ പച്ചവെള്ളത്തിലിടുക. അതിനുശേഷം ബെഡിലിടുക.</p>
            <p>8.തേക്ക് : രണ്ട് ദിവസം പച്ചവെള്ളത്തിലിടുക മൂന്നാം ദിവസം ഭാരം കയറ്റി വെയ്ക്കുക. നാലാം ദിവസം വീണ്ടും പച്ചവെള്ളത്തിലിടുക. അഞ്ചാം ദിവസം ബെഡിലിടുക. മുകളില്‍ മണ്ണിടുക. അതിന് മുകളില്‍ വൈക്കോല്‍ ഇടുക.</p>
            <p>9.മുരിങ്ങ : 24 മണിക്കൂര്‍ പശുവിന്‍ പാലില്‍ ഇടുക അതിന് ശേഷം ബെഡിലിടുക.</p>
            <p>10.മണിമരുത് : വിത്തുകള്‍ ഒന്നു പൊട്ടിച്ചശേഷം രണ്ട് മണിക്കൂര്‍ പച്ചവെള്ള ത്തിലിടുക. അതിന് ശേഷം ബെഡിലിടുക.</p>
            <p>11.കൊടംപുളി : നേരിട്ട് ബെഡിലിടുക. മുകളില്‍ മണ്ണിട്ടു നനക്കുക.</p>
            <br/>
            <p>NB: ചെറിയ വിത്തുകള്‍ കവറില്‍ നേരിട്ട് മുളപ്പിക്കരുത് (പേര, മാതളം, നെല്ലി, മുള എന്നിവ) പേരക്കയും കൊടംപുളിയും മുളക്കാന്‍ ഒരു മാസം പിടിക്കും. (നനക്കാതിരിക്കരുത്.).</p>
      
          </Col>
        </Row>
      </Container>
      <Footer/>
    </>
  );
};

export default Instruction;
