import React from 'react';
import NavigationBar from '@/components/navigationBar';
import Footer from '@/components/footer';
import Earth from '@/components/earth';

const Competition = () => {
    return (
        <div>
            <NavigationBar />
            <div className="mt-6 mb-3 flex justify-center items-center">
                <h1 className="text-4xl font-bold text-center items-center">Competition</h1>
            </div>

            {/* First div */}
            <div className="ml-9 mr-7 mt-9 shadow-xl">
                <div className="flex">
                    {/* Small green part */}
                    <div style={{ backgroundColor: '#FBD784', width: '6%', borderRadius: '8px 0 0 8px' }}></div>
                    {/* Larger part with heading and paragraph */}
                    <div className="ml-10 mb-10 mt-7 p-5">
                        <h2 className="text-xl font-bold">ഗ്രീൻ ക്ലീൻ കേരള -വൃക്ഷത്തൈ പരിപാലന മത്സരം 2023-24 ടാർഗറ്റ്-ഈ വർഷം 10 ലക്ഷം തൈകൾ</h2>
                        <p className="mt-2">
                            പരിസ്ഥിതി ദിനത്തിലും തുടർന്നും നടുന്ന വൃക്ഷത്തൈകൾ വേനൽക്കാലത്ത്‌ സംരക്ഷിക്കുന്നതിനെ പ്രോത്സാഹിപ്പിക്കാൻ, അതിന്റെ കൂടെ ഓരോ മൂന്ന് മാസം കൂടുമ്പോഴും ഒരു സെൽഫി എടുത്ത് ഈ വെബ് സൈറ്റിൽ അപ്ലോഡ് ചെയ്താൽ ഭാഗ്യശാലികൾക്ക് സമ്മാനങ്ങൾ നൽകുന്നു. ഇങ്ങനെ ഒരു കോടി വൃക്ഷത്തൈകൾ കേരളത്തിൽ നിന്നും സംരക്ഷിച്ച് ഐക്യ രാഷ്ട്ര സഭയുടെ പരിസ്ഥിതി വിഭാഗമായ UNEP യിലേക്ക് കേരള സർക്കാർ മുഖേനെ സമർപ്പിക്കുവാൻ ലക്ഷ്യമിടുന്നു. ഒപ്പം കേരളം മാലിന്യമുക്തവും ഹരിതാഭവും ആക്കുവാൻ ജനങ്ങൾ തയ്യാറാക്കുന്ന 1000 കോടി രൂപയുടെ പ്രൊജക്റ്റ് റിപ്പോർട്ടും UNEP യിലേക്ക് സമർപ്പിക്കുന്നു. വൃക്ഷത്തൈ പരിപാലനമത്സരത്തിൽ പങ്കെടുക്കുന്ന വിധം താഴെ വിശദമായി കൊടുത്തിരിക്കുന്നു.
                        </p>
                    </div>
                </div>
            </div>

            {/* Second div */}
            <div className="ml-9 mr-7 mt-9 shadow-xl">
                <div className="flex">
                    {/* Small green part */}
                    <div style={{ backgroundColor: '#FBD784', width: '4%', borderRadius: '8px 0 0 8px' }}></div>
                    {/* Larger part with heading and paragraph */}
                    <div className="ml-10 mb-10 mt-7 p-5">
                        <h2 className="text-xl font-bold">ഹരിത മത്സരങ്ങൾ 2023-24 വിദ്യാർത്ഥികൾക്ക് -ശാസ്ത്ര-ഹരിത-മത്സരങ്ങളും, അവാർഡുകളും, സമ്മാനങ്ങളും</h2>
                        <p className="mt-2">
                            ഗ്രീൻ ക്ളീൻ കേരള വൃക്ഷത്തൈ പരിപാലന മത്സരങ്ങളുടെ ഭാഗമായി 2023 ജൂൺ 5 മുതൽ 2024 ജൂൺ 5 വരെ ഹരിത മത്സരങ്ങൾ സംഘടിപ്പിക്കുന്നു. 1-വൃക്ഷത്തൈ പരിപാലന മത്സരം, 2- ഗ്രീൻ ആക്ടിവിറ്റി മത്സരം, 3- ശാസ്ത്ര പ്രദർശന മത്സരം, 4-ഓൺലൈൻ ക്വിസ് മത്സരം, 5-കലാ മത്സരങ്ങൾ, 6- നൂതന ആശയ മത്സരം, 7- ഗ്രീൻ ക്ലീൻ കേരള പ്രോജെക്ട് റിപ്പോർട്ട് മുതലായവയാണ് മത്സരത്തിൽ ഉൾപ്പെടുത്തിയിട്ടുള്ളത്.
                        </p>
                    </div>
                </div>
            </div>

            {/* Third div */}
            <div className="ml-9 mr-7 mt-9 shadow-xl">
                <div className="flex">
                    {/* Small green part */}
                    <div style={{ backgroundColor: '#FBD784', width: '8%', borderRadius: '8px 0 0 8px' }}></div>
                    {/* Larger part with heading and paragraph */}
                    <div className="ml-10 mb-10 mt-7 p-5">
                        <h2 className="text-xl font-bold">പ്രൊഫസ്സർ ശോഭീന്ദ്രൻ സ്മാരക പരിസ്ഥിതി അവാർഡ്</h2>
                        <p className="mt-2">
                            ലോകത്തെ 182 രാജ്യങ്ങളിൽ .....<br /> ഇന്ത്യയിലെ 28 സംസ്ഥാനങ്ങളിൽ -8 കേന്ദ്ര ഭരണ പ്രദേശങ്ങളിൽ .....<br /> കേരളത്തിലെ 1200 തദ്ദേശ സ്വയം ഭരണ സ്ഥാപനങ്ങളിൽ .....<br /><br />
                            2024 ജൂൺ 5 ലോക പരിസ്ഥിതി ദിനത്തിൻറെ പ്രമേയമായ -ഹരിതാഭമായ ഭാവിയിലേക്കുള്ള പ്രയാണം (Journey to a Greener Future), എന്ന പ്രമേയത്തിന്റെയും, കേരളത്തിൽ നിന്നും ഒരു കോടി വൃക്ഷത്തൈകൾ നട്ടു വളർത്തി അതിന്റെ വിവിധ ഘട്ടങ്ങളിലുള്ള വളർച്ച പ്രകടമാവുന്ന ഫോട്ടോ www.GreenCleanEarth.org എന്ന വെബ്‌സൈറ്റിൽ പ്രസിദ്ധീകരിച്ച് UNEP യിലേക്ക് സമർപ്പിക്കുന്നതിന്റെയും പ്രചരണാർത്തം, കേരളത്തിലെ 1200 തദ്ദേശ സ്വയം ഭരണ സ്ഥാപനങ്ങളിൽ, ഇന്ത്യയിലെ 28 സംസ്ഥാനങ്ങളിൽ, 8 കേന്ദ്ര ഭരണ പ്രദേശങ്ങളിൽ ലോകത്തെ മലയാളികൾ ഉള്ള 182 രാജ്യങ്ങളിൽ പ്രൊഫസർ ശോഭീന്ദ്രൻറെ പേരിൽ 14 കേരളീയ മരങ്ങളുടെ ഒരോ കുഞ്ഞു തോട്ടങ്ങൾ -ശോഭീന്ദ്ര വനം - നിർമ്മിച്ച് ഒരുകോടി വൃക്ഷത്തൈ സെൽഫികളോടൊപ്പം UNEP യിലേക്ക് സമർപ്പിക്കുന്നു. കേരള സർക്കാറിന്റെ പ്രവാസിക്കൂട്ടായ്മയായ ലോക കേരള സഭയുടെ സഹകരണത്തോടെ യാണ് പദ്ധതി നടപ്പാക്കുന്നത്.
                            <br /><br /> നിങ്ങൾക്കും പങ്കാളിയാവാം <br />
                            1) നിങ്ങൾ മേല്പറഞ്ഞ ഏതെങ്കിലും പ്രദേശത്ത് താമസിക്കുന്നവരാണെങ്കിൽ ആ പ്രദേശത്ത് ഒരു തൈ നട്ട് അതിൻറെ കൂടെ ഒരു സെൽഫി എടുത്ത് ഓരോ മൂന്ന് മാസം കൂടുമ്പോഴും www.GreenCleanEarth.org എന്ന വെബ്‌സൈറ്റിൽ അപ്‌ലോഡ് ചെയ്യുക.<br />
                            2) അടുത്ത ജൂൺ 5 ന് ആ പ്രദേശത്തെ മലയാളിക്കൂട്ടായ്മകളുടെയും, പ്രാദേശിക ഭരണകൂടത്തിന്റെയും സഹകരണത്തോടെ അവിടെ 14 കേരളീയ മരങ്ങളുടെ ഒരുകുഞ്ഞു തോട്ടം -ശോഭീന്ദ്ര വനം - വച്ചു പിടിപ്പിക്കാനുള്ള ഏർപ്പാട് ചെയ്യുക.<br />
                            3) നിങ്ങളുടെ ബന്ധുക്കളോ സുഹൃത്തുക്കളോ മേല്പറഞ്ഞ പ്രദേശങ്ങളിൽ ഉണ്ടെങ്കിൽ അവരെ ഈ വിവരം അറിയിച്ച്, ആ പ്രദേശങ്ങളിൽ മേല്പറഞ്ഞ പ്രവർത്തനങ്ങൾ നടപ്പിലാക്കാൻ, ഗ്രീൻ ക്ലീൻ കേരള മിഷനുമായി ബന്ധപ്പെടാൻ വേണ്ട നടപടികൾ സ്വീകരിക്കുക.
                        </p>
                    </div>
                </div>
            </div>

            {/* Fourth div */}
            <div className="ml-9 mr-7 mt-9 shadow-xl">
                <div className="flex">
                    {/* Small green part */}
                    <div style={{ backgroundColor: '#FBD784', width: '4%', borderRadius: '8px 0 0 8px' }}></div>
                    {/* Larger part with heading and paragraph */}
                    <div className="ml-10 mb-10 mt-7 p-5">
                        <h2 className="text-xl font-bold">ലക്ഷ്യം -മൂന്നരക്കോടി വൃക്ഷങ്ങൾ -ഓരോ മലയാളിയും ഓരോ തൈ 14 ലക്ഷം ഹരിത ഭവനങ്ങൾ 1000 കാർബൺ ന്യൂട്രൽ ഗ്രാമങ്ങൾ</h2>
                        <p className="mt-2">
                            പദ്ധതിയുടെ ഭാഗമായി ലോകത്താകമാനമുള്ള മലയാളികൾ 3.51 കോടി വൃക്ഷങ്ങൾ നട്ട് പരിപാലിച്ച് -പ്രാണവായുവിൻറെ ശുദ്ധീകരണത്തിനായി ലോക മലയാളികളുടെ കാണിക്ക എന്ന മുദ്രാവാക്യവുമായി -ലോകത്തിന് സമർപ്പിക്കുന്നു. അതോടൊപ്പം കേരളത്തിൽ 14 ലക്ഷം ഹരിത ഭവനങ്ങളും 1000 കാർബൺ ന്യൂട്രൽ ഗ്രാമങ്ങളും യാഥാർഥ്യമാക്കാൻ വേണ്ട പ്രവർത്തങ്ങൾ നടപ്പിലാക്കുന്നു. 2026 ജൂൺ 5 ന് ഇത് യാഥാർഥ്യമാക്കാൻ ലക്ഷ്യമിടുന്നു.
                        </p>
                    </div>
                </div>
            </div>

            {/* Fifth div */}
            <div className="ml-9 mr-7 mt-9 shadow-xl">
                <div className="flex">
                    {/* Small green part */}
                    <div style={{ backgroundColor: '#FBD784', width: '10%', borderRadius: '8px 0 0 8px' }}></div>
                    {/* Larger part with heading and paragraph */}
                    <div className="ml-10 mb-10 mt-7 p-5">
                        <h2 className="text-xl font-bold">1000 കോടി രൂപയുടെ-ഗ്രീൻ ക്ലീൻ എസ്റ്റിമേറ്റ്</h2>
                        <p className="mt-2">
                            മേല്പറഞ്ഞ പദ്ധതികൾ യാഥാർഥ്യമാക്കനായി ഈ മത്സരങ്ങളിൽ പങ്കെടുക്കുന്ന കൂട്ടായ്മകൾ തയ്യാറാക്കുന്ന, ആയിരം കോടി രൂപയുടെ ഗ്രീൻ ക്ലീൻ കേരള പ്രൊജക്റ്റ് റിപ്പോർട്ട്, കേരള സർക്കാർ മുഖേനെ കേന്ദ്ര സർക്കാരിനും UNEPക്കും സമർപ്പിക്കുന്നു. പൊതു പച്ചത്തുരുത്തുകൾ, മാലിന്യ സംസ്കരണ സംവിധാനങ്ങൾ, ജൈവ വൈവിധ്യ ഉദ്യാനങ്ങൾ, ഔഷധ സസ്യ തോട്ടങ്ങൾ, ഹരിത ഉത്പന്നങ്ങൾ എന്നിവയുടെ നിർമ്മാണത്തിനും പ്രചാരണത്തിനും ആണ് ഈ തുക ഉപയോഗിക്കുന്നത്. ഓരോ വാർഡുകളും 10000 രൂപയുടെ പ്രൊജക്റ്റ് വെച്ചാൽ ഒരു ലക്ഷം രൂപ ഓരോ വിഭാഗത്തിലും ധനസഹായം ലഭ്യമാകുന്ന തരത്തിലാണ് പദ്ധതി തയ്യാറാക്കിയിരിക്കുന്നത്. മത്സരത്തിൽ പങ്കെടുക്കുന്ന കേരളത്തിലെ 941 ഗ്രാമപഞ്ചായത്തിലെ 15962 വാർഡുകൾക്കും 87 മുനിസിപ്പാലിറ്റിയിലെ 3122 വാർഡുകൾക്കും, 6 കോർപറേഷനുകളിലെ 414 വാർഡുകൾക്കും ഇത് ലഭിക്കുന്നതാണ്. കൂടാതെ 152 ബ്ലോക്ക് പഞ്ചായത്തിലെ 2079 ഡിവിഷനുകൾക്കും 14 ജില്ലാ പഞ്ചായത്തുകളിലെ 331 ഡിവിഷനുകൾക്കും ഇതിന്റെ ഗുണം ലഭിക്കുന്നതാണ്. മത്സരത്തിൽ മികച്ച പ്രകടനം കാഴ്ചവെക്കുന്നവർക്ക്, ഫല വൃക്ഷത്തൈകൾ, മാലിന്യ സംസ്കരണ സംവിധാനങ്ങൾ, കാർഷിക ഉപകരണങ്ങൾ, സോളാർ ഉപകരണങ്ങൾ, പഠനോപകരണങ്ങൾ, ഇലക്ട്രിക് വാഹനങ്ങൾ മുതലായവ സമ്മാനമായി നല്കാൻ ഉദ്ദേശിക്കുന്നു. 10% തുക വീതം ഗ്രാമ പഞ്ചായത്തുകളും ബ്ലോക്ക് പഞ്ചായത്തുകളും, ജില്ലാ പഞ്ചായത്തുകളും 30% വീതം മുനിസിപ്പാലിറ്റികളും, കോർപ്പറേഷനുകളും 10% കേരളസർക്കാറും 10% കേന്ദ്ര സർക്കാറും ബാക്കി 50% തുക UNEP യും വകയിരുത്തിയാൽ നടപ്പാക്കാവുന്ന തരത്തിലാണ് പദ്ധതി തയ്യാറാക്കിയിരിക്കുന്നത്. Green Creative Hub എന്ന പേരിൽ Education & Research center ഉം പദ്ധതിയിലൂടെ നടപ്പാക്കുന്നു.
                        </p>
                    </div>
                </div>
            </div>
            
            <Earth />
            <Footer />
        </div>
    );
}

export default Competition;
