import Footer from "@/components/footer";
import React, { useState, useEffect } from 'react';
import NavigationBar from '@/components/navigationBar';

const NewsCard = ({ title, image, smallHeading, paragraph }) => {
  return (
    <div className="flex flex-col p-4 mb-6 shadow-md rounded-lg" style={{backgroundColor:'#d3d3d3'}}>
      <h2 className="text-xl font-bold mb-2">{title}</h2>
      <div className="flex">
        <img src={image} alt="news" className="w-1/3  object-cover mr-4 rounded-lg" />
        <div className="flex flex-col justify-between w-2/3">
          <div>
            <h3 className="text-lg font-semibold mb-1">{smallHeading}</h3>
            <p className="mb-2">{paragraph}</p>
          </div>
          <div className="flex mt-10">
            <button className=" " style={{backgroundColor:'#d3d3d3',borderRadius:'5px'}}>
              Read More >>
            </button>
          </div>
        </div>
      </div>
    </div>
  );
};

const Latestnews = () => {

 
  const newsData = [
    {
      title: "സുരഭി ലക്ഷ്മി ഗ്രീൻ ക്‌ളീൻ എർത്ത് മൂവേമെന്റ്- ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റു.",
      image: "/images/morenews1.png",
      smallHeading: "20 June 2020, കോഴിക്കോട്",
      paragraph: "പ്രശസ്ത ചലച്ചിത്ര നടിയും 2016 ലെ മികച്ച നടിക്കുള്ള ദേശീയ അവാർഡ് ജേതാവുമായ സുരഭി ലക്ഷ്മി മൂവ് മെന്റിന്റെ ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റത്തിന് ശേഷം ഒരു വർഷത്തെ പ്രവർത്തന രൂപരേഖ പ്രഖ്യാപിച്ചു.2017 ജൂൺ 19 തിങ്കളാഴ്ച രണ്ട് മണിക്ക് ഗവണ്മെന്റ് ആർട്സ് & സയിൻസ് കളേജ് മീഞ്ചന്തയിൽ വെച്ചാണ് ചടങ്ങ് നടന്നത് ശ്രീഎംകെ മുനീർ MLA യുടെ അധ്യക്ഷതയിൽ നടന്ന യോഗം, ശ്രീ പ്രദീപ്കുമാർ MLA ഉത്ഘാടനം ചെയ്യുകയും ശ്രീ, PTA റഹിം MLAബ്രാൻഡ് അംബാസ്സഡർ പ്രഖ്യാപനം നടത്തുകയും ജില്ലാ പഞ്ചായത്ത് പ്രസിഡണ്ട് ശ്രീ.ബാബുപറശ്ശേരി സുരഭിക്ക് ജിസം ഫൗണ്ടേഷന്റെ സ്നേഹോപഹാരം നൽകുകയും ചെയ്തു",
    },
    {
      title: "സുരഭി ലക്ഷ്മി ഗ്രീൻ ക്‌ളീൻ എർത്ത് മൂവേമെന്റ്- ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റു.",
      image: "/images/morenews1.png",
      smallHeading: "20 June 2020, കോഴിക്കോട്",
      paragraph: "പ്രശസ്ത ചലച്ചിത്ര നടിയും 2016 ലെ മികച്ച നടിക്കുള്ള ദേശീയ അവാർഡ് ജേതാവുമായ സുരഭി ലക്ഷ്മി മൂവ് മെന്റിന്റെ ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റത്തിന് ശേഷം ഒരു വർഷത്തെ പ്രവർത്തന രൂപരേഖ പ്രഖ്യാപിച്ചു.2017 ജൂൺ 19 തിങ്കളാഴ്ച രണ്ട് മണിക്ക് ഗവണ്മെന്റ് ആർട്സ് & സയിൻസ് കളേജ് മീഞ്ചന്തയിൽ വെച്ചാണ് ചടങ്ങ് നടന്നത് ശ്രീഎംകെ മുനീർ MLA യുടെ അധ്യക്ഷതയിൽ നടന്ന യോഗം, ശ്രീ പ്രദീപ്കുമാർ MLA ഉത്ഘാടനം ചെയ്യുകയും ശ്രീ, PTA റഹിം MLAബ്രാൻഡ് അംബാസ്സഡർ പ്രഖ്യാപനം നടത്തുകയും ജില്ലാ പഞ്ചായത്ത് പ്രസിഡണ്ട് ശ്രീ.ബാബുപറശ്ശേരി സുരഭിക്ക് ജിസം ഫൗണ്ടേഷന്റെ സ്നേഹോപഹാരം നൽകുകയും ചെയ്തു",
    },
    {
      title: "സുരഭി ലക്ഷ്മി ഗ്രീൻ ക്‌ളീൻ എർത്ത് മൂവേമെന്റ്- ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റു.",
      image: "/images/morenews1.png",
      smallHeading: "20 June 2020, കോഴിക്കോട്",
      paragraph: "പ്രശസ്ത ചലച്ചിത്ര നടിയും 2016 ലെ മികച്ച നടിക്കുള്ള ദേശീയ അവാർഡ് ജേതാവുമായ സുരഭി ലക്ഷ്മി മൂവ് മെന്റിന്റെ ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റത്തിന് ശേഷം ഒരു വർഷത്തെ പ്രവർത്തന രൂപരേഖ പ്രഖ്യാപിച്ചു.2017 ജൂൺ 19 തിങ്കളാഴ്ച രണ്ട് മണിക്ക് ഗവണ്മെന്റ് ആർട്സ് & സയിൻസ് കളേജ് മീഞ്ചന്തയിൽ വെച്ചാണ് ചടങ്ങ് നടന്നത് ശ്രീഎംകെ മുനീർ MLA യുടെ അധ്യക്ഷതയിൽ നടന്ന യോഗം, ശ്രീ പ്രദീപ്കുമാർ MLA ഉത്ഘാടനം ചെയ്യുകയും ശ്രീ, PTA റഹിം MLAബ്രാൻഡ് അംബാസ്സഡർ പ്രഖ്യാപനം നടത്തുകയും ജില്ലാ പഞ്ചായത്ത് പ്രസിഡണ്ട് ശ്രീ.ബാബുപറശ്ശേരി സുരഭിക്ക് ജിസം ഫൗണ്ടേഷന്റെ സ്നേഹോപഹാരം നൽകുകയും ചെയ്തു",
    },
    {
      title: "സുരഭി ലക്ഷ്മി ഗ്രീൻ ക്‌ളീൻ എർത്ത് മൂവേമെന്റ്- ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റു.",
      image: "/images/morenews1.png",
      smallHeading: "20 June 2020, കോഴിക്കോട്",
      paragraph: "പ്രശസ്ത ചലച്ചിത്ര നടിയും 2016 ലെ മികച്ച നടിക്കുള്ള ദേശീയ അവാർഡ് ജേതാവുമായ സുരഭി ലക്ഷ്മി മൂവ് മെന്റിന്റെ ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റത്തിന് ശേഷം ഒരു വർഷത്തെ പ്രവർത്തന രൂപരേഖ പ്രഖ്യാപിച്ചു.2017 ജൂൺ 19 തിങ്കളാഴ്ച രണ്ട് മണിക്ക് ഗവണ്മെന്റ് ആർട്സ് & സയിൻസ് കളേജ് മീഞ്ചന്തയിൽ വെച്ചാണ് ചടങ്ങ് നടന്നത് ശ്രീഎംകെ മുനീർ MLA യുടെ അധ്യക്ഷതയിൽ നടന്ന യോഗം, ശ്രീ പ്രദീപ്കുമാർ MLA ഉത്ഘാടനം ചെയ്യുകയും ശ്രീ, PTA റഹിം MLAബ്രാൻഡ് അംബാസ്സഡർ പ്രഖ്യാപനം നടത്തുകയും ജില്ലാ പഞ്ചായത്ത് പ്രസിഡണ്ട് ശ്രീ.ബാബുപറശ്ശേരി സുരഭിക്ക് ജിസം ഫൗണ്ടേഷന്റെ സ്നേഹോപഹാരം നൽകുകയും ചെയ്തു",
    },
    {
      title: "സുരഭി ലക്ഷ്മി ഗ്രീൻ ക്‌ളീൻ എർത്ത് മൂവേമെന്റ്- ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റു.",
      image: "/images/morenews1.png",
      smallHeading: "20 June 2020, കോഴിക്കോട്",
      paragraph: "പ്രശസ്ത ചലച്ചിത്ര നടിയും 2016 ലെ മികച്ച നടിക്കുള്ള ദേശീയ അവാർഡ് ജേതാവുമായ സുരഭി ലക്ഷ്മി മൂവ് മെന്റിന്റെ ബ്രാൻഡ് അംബാസഡർ ആയി ചുമതലയേറ്റത്തിന് ശേഷം ഒരു വർഷത്തെ പ്രവർത്തന രൂപരേഖ പ്രഖ്യാപിച്ചു.2017 ജൂൺ 19 തിങ്കളാഴ്ച രണ്ട് മണിക്ക് ഗവണ്മെന്റ് ആർട്സ് & സയിൻസ് കളേജ് മീഞ്ചന്തയിൽ വെച്ചാണ് ചടങ്ങ് നടന്നത് ശ്രീഎംകെ മുനീർ MLA യുടെ അധ്യക്ഷതയിൽ നടന്ന യോഗം, ശ്രീ പ്രദീപ്കുമാർ MLA ഉത്ഘാടനം ചെയ്യുകയും ശ്രീ, PTA റഹിം MLAബ്രാൻഡ് അംബാസ്സഡർ പ്രഖ്യാപനം നടത്തുകയും ജില്ലാ പഞ്ചായത്ത് പ്രസിഡണ്ട് ശ്രീ.ബാബുപറശ്ശേരി സുരഭിക്ക് ജിസം ഫൗണ്ടേഷന്റെ സ്നേഹോപഹാരം നൽകുകയും ചെയ്തു",
    },
  ];
  
  return (
    <div>
      <NavigationBar/>
      <div className="flex justify-center items-center" style={{ marginTop: '50px' }}>
        <h1 className="text-3xl font-bold">Latest News</h1>
      </div>
      <div className="container mx-auto p-4">
        {newsData.map((news, index) => (
          <NewsCard
            key={index}
            title={news.title}
            image={news.image}
            smallHeading={news.smallHeading}
            paragraph={news.paragraph}
          />
        ))}
      </div>
      {/* button  */}
      <Footer></Footer>
    </div>
  );
};

export default Latestnews;
